{
  "resume_highlights": [
    "Led Shopify-NetSuite integration at Santo Remedio",
    "Reduced order sync errors by 90%",
    "Managed cross-functional teams of 8+ people"
  ],
  "star_stories": [
    {
      "situation": "At Santo Remedio, we faced a conflict between engineering and operations during our Shopify-NetSuite rollout.",
      "task": "I needed to resolve the tension and get the project back on track within two weeks.",
      "action": "I set up cross-functional sprint reviews where each team explained blockers openly, then mediated by breaking problems into smaller integration tasks with clear ownership.",
      "result": "This reduced tension, gave everyone ownership, and led to a smoother launch with order sync errors dropping by 90% within two weeks.",
      "keywords": [
        "conflict",
        "team",
        "integration",
        "mediation",
        "leadership"
      ]
    },
    {
      "situation": "Our e-commerce platform was experiencing 30% cart abandonment due to slow checkout performance.",
      "task": "I was tasked with improving checkout speed and reducing abandonment rates.",
      "action": "I implemented database query optimization, added Redis caching, and streamlined the payment flow by removing unnecessary form fields.",
      "result": "Checkout time decreased by 60% and cart abandonment dropped to 18%, resulting in $200K additional monthly revenue.",
      "keywords": [
        "performance",
        "optimization",
        "e-commerce",
        "technical",
        "results"
      ]
    }
  ],
  "technical_projects": [
    {
      "name": "E-commerce Integration Platform",
      "technologies": [
        "Python",
        "Django",
        "PostgreSQL",
        "Redis",
        "API Integration"
      ],
      "description": "Built automated order sync system connecting Shopify with NetSuite ERP",
      "impact": "Reduced manual processing time by 80% and eliminated data sync errors"
    }
  ],
  "skills": [
    "Python",
    "System Integration",
    "Team Leadership",
    "API Design",
    "Database Optimization",
    "Cross-functional Collaboration"
  ],
  "experience": [
    {
      "company": "Santo Remedio",
      "role": "Technical Lead",
      "duration": "2022-2024",
      "achievements": [
        "90% error reduction in order processing",
        "Led team of 8 engineers and operations staff",
        "$200K monthly revenue increase through performance improvements"
      ]
    }
  ]
}